feat: AutoPush
